GopalSaraf/Practicals/PSDL/include/proc/pic16f18075.inc
// Register: DAC1DATL
#define DAC1DATL DAC1DATL
DAC1DATL                                 equ 0110Dh
// bitfield definitions
DAC1DATL_DAC1R_POSN                      equ 0000h
DAC1DATL_DAC1R_POSITION                  equ 0000h
DAC1DATL_DAC1R_SIZE                      equ 0008h
DAC1DATL_DAC1R_LENGTH                    equ 0008h
DAC1DATL_DAC1R_MASK                      equ 00FFh
DAC1DATL_DAT_POSN                        equ 0000h
DAC1DATL_DAT_POSITION                    equ 0000h
DAC1DATL_DAT_SIZE                        equ 0008h
DAC1DATL_DAT_LENGTH                      equ 0008h
DAC1DATL_DAT_MASK                        equ 00FFh

// Register: NVMADRL
#define NVMADRL NVMADRL
NVMADRL                                  equ 01C8Ch
// bitfield definitions
NVMADRL_NVMADR_POSN                      equ 0000h
NVMADRL_NVMADR_POSITION                  equ 0000h
NVMADRL_NVMADR_SIZE                      equ 0008h
NVMADRL_NVMADR_LENGTH                    equ 0008h
NVMADRL_NVMADR_MASK                      equ 00FFh
NVMADRL_NVMADR0_POSN                     equ 0000h
NVMADRL_NVMADR0_POSITION                 equ 0000h
NVMADRL_NVMADR0_SIZE                     equ 0001h
NVMADRL_NVMADR0_LENGTH                   equ 0001h
NVMADRL_NVMADR0_MASK                     equ 0001h
NVMADRL_NVMADR1_POSN                     equ 0001h
NVMADRL_NVMADR1_POSITION                 equ 0001h
NVMADRL_NVMADR1_SIZE                     equ 0001h
NVMADRL_NVMADR1_LENGTH                   equ 0001h
NVMADRL_NVMADR1_MASK                     equ 0002h
NVMADRL_NVMADR2_POSN                     equ 0002h
NVMADRL_NVMADR2_POSITION                 equ 0002h
NVMADRL_NVMADR2_SIZE                     equ 0001h
NVMADRL_NVMADR2_LENGTH                   equ 0001h
NVMADRL_NVMADR2_MASK                     equ 0004h
NVMADRL_NVMADR3_POSN                     equ 0003h
NVMADRL_NVMADR3_POSITION                 equ 0003h
NVMADRL_NVMADR3_SIZE                     equ 0001h
NVMADRL_NVMADR3_LENGTH                   equ 0001h
NVMADRL_NVMADR3_MASK                     equ 0008h
NVMADRL_NVMADR4_POSN                     equ 0004h
NVMADRL_NVMADR4_POSITION                 equ 0004h
NVMADRL_NVMADR4_SIZE                     equ 0001h
NVMADRL_NVMADR4_LENGTH                   equ 0001h
NVMADRL_NVMADR4_MASK                     equ 0010h
NVMADRL_NVMADR5_POSN                     equ 0005h
NVMADRL_NVMADR5_POSITION                 equ 0005h
NVMADRL_NVMADR5_SIZE                     equ 0001h
NVMADRL_NVMADR5_LENGTH                   equ 0001h
NVMADRL_NVMADR5_MASK                     equ 0020h
NVMADRL_NVMADR6_POSN                     equ 0006h
NVMADRL_NVMADR6_POSITION                 equ 0006h
NVMADRL_NVMADR6_SIZE                     equ 0001h
NVMADRL_NVMADR6_LENGTH                   equ 0001h
NVMADRL_NVMADR6_MASK                     equ 0040h
NVMADRL_NVMADR7_POSN                     equ 0007h
NVMADRL_NVMADR7_POSITION                 equ 0007h
NVMADRL_NVMADR7_SIZE                     equ 0001h
NVMADRL_NVMADR7_LENGTH                   equ 0001h
NVMADRL_NVMADR7_MASK                     equ 0080h

// Register: NVMADRH
#define NVMADRH NVMADRH
NVMADRH                                  equ 01C8Dh
// bitfield definitions
NVMADRH_NVMADR_POSN                      equ 0000h
NVMADRH_NVMADR_POSITION                  equ 0000h
NVMADRH_NVMADR_SIZE                      equ 0007h
NVMADRH_NVMADR_LENGTH                    equ 0007h
NVMADRH_NVMADR_MASK                      equ 007Fh
NVMADRH_NVMADR8_POSN                     equ 0000h
NVMADRH_NVMADR8_POSITION                 equ 0000h
NVMADRH_NVMADR8_SIZE                     equ 0001h
NVMADRH_NVMADR8_LENGTH                   equ 0001h
NVMADRH_NVMADR8_MASK                     equ 0001h
NVMADRH_NVMADR9_POSN                     equ 0001h
NVMADRH_NVMADR9_POSITION                 equ 0001h
NVMADRH_NVMADR9_SIZE                     equ 0001h
NVMADRH_NVMADR9_LENGTH                   equ 0001h
NVMADRH_NVMADR9_MASK                     equ 0002h
NVMADRH_NVMADR10_POSN                    equ 0002h
NVMADRH_NVMADR10_POSITION                equ 0002h
NVMADRH_NVMADR10_SIZE                    equ 0001h
NVMADRH_NVMADR10_LENGTH                  equ 0001h
NVMADRH_NVMADR10_MASK                    equ 0004h
NVMADRH_NVMADR11_POSN                    equ 0003h
NVMADRH_NVMADR11_POSITION                equ 0003h
NVMADRH_NVMADR11_SIZE                    equ 0001h
NVMADRH_NVMADR11_LENGTH                  equ 0001h
NVMADRH_NVMADR11_MASK                    equ 0008h
NVMADRH_NVMADR12_POSN                    equ 0004h
NVMADRH_NVMADR12_POSITION                equ 0004h
NVMADRH_NVMADR12_SIZE                    equ 0001h
NVMADRH_NVMADR12_LENGTH                  equ 0001h
NVMADRH_NVMADR12_MASK                    equ 0010h
NVMADRH_NVMADR13_POSN                    equ 0005h
NVMADRH_NVMADR13_POSITION                equ 0005h
NVMADRH_NVMADR13_SIZE                    equ 0001h
NVMADRH_NVMADR13_LENGTH                  equ 0001h
NVMADRH_NVMADR13_MASK                    equ 0020h
NVMADRH_NVMADR14_POSN                    equ 0006h
NVMADRH_NVMADR14_POSITION                equ 0006h
NVMADRH_NVMADR14_SIZE                    equ 0001h
NVMADRH_NVMADR14_LENGTH                  equ 0001h
NVMADRH_NVMADR14_MASK                    equ 0040h

// Register: NVMDATL
#define NVMDATL NVMDATL
NVMDATL                                  equ 01C8Eh
// bitfield definitions
NVMDATL_NVMDAT_POSN                      equ 0000h
NVMDATL_NVMDAT_POSITION                  equ 0000h
NVMDATL_NVMDAT_SIZE                      equ 0008h
NVMDATL_NVMDAT_LENGTH                    equ 0008h
NVMDATL_NVMDAT_MASK                      equ 00FFh
NVMDATL_NVMDAT0_POSN                     equ 0000h
NVMDATL_NVMDAT0_POSITION                 equ 0000h
NVMDATL_NVMDAT0_SIZE                     equ 0001h
NVMDATL_NVMDAT0_LENGTH                   equ 0001h
NVMDATL_NVMDAT0_MASK                     equ 0001h
NVMDATL_NVMDAT1_POSN                     equ 0001h
NVMDATL_NVMDAT1_POSITION                 equ 0001h
NVMDATL_NVMDAT1_SIZE                     equ 0001h
NVMDATL_NVMDAT1_LENGTH                   equ 0001h
NVMDATL_NVMDAT1_MASK                     equ 0002h
NVMDATL_NVMDAT2_POSN                     equ 0002h
NVMDATL_NVMDAT2_POSITION                 equ 0002h
NVMDATL_NVMDAT2_SIZE                     equ 0001h
NVMDATL_NVMDAT2_LENGTH                   equ 0001h
NVMDATL_NVMDAT2_MASK                     equ 0004h
NVMDATL_NVMDAT3_POSN                     equ 0003h
NVMDATL_NVMDAT3_POSITION                 equ 0003h
NVMDATL_NVMDAT3_SIZE                     equ 0001h
NVMDATL_NVMDAT3_LENGTH                   equ 0001h
NVMDATL_NVMDAT3_MASK                     equ 0008h
NVMDATL_NVMDAT4_POSN                     equ 0004h
NVMDATL_NVMDAT4_POSITION                 equ 0004h
NVMDATL_NVMDAT4_SIZE                     equ 0001h
NVMDATL_NVMDAT4_LENGTH                   equ 0001h
NVMDATL_NVMDAT4_MASK                     equ 0010h
NVMDATL_NVMDAT5_POSN                     equ 0005h
NVMDATL_NVMDAT5_POSITION                 equ 0005h
NVMDATL_NVMDAT5_SIZE                     equ 0001h
NVMDATL_NVMDAT5_LENGTH                   equ 0001h
NVMDATL_NVMDAT5_MASK                     equ 0020h
NVMDATL_NVMDAT6_POSN                     equ 0006h
NVMDATL_NVMDAT6_POSITION                 equ 0006h
NVMDATL_NVMDAT6_SIZE                     equ 0001h
NVMDATL_NVMDAT6_LENGTH                   equ 0001h
NVMDATL_NVMDAT6_MASK                     equ 0040h
NVMDATL_NVMDAT7_POSN                     equ 0007h
NVMDATL_NVMDAT7_POSITION                 equ 0007h
NVMDATL_NVMDAT7_SIZE                     equ 0001h
NVMDATL_NVMDAT7_LENGTH                   equ 0001h
NVMDATL_NVMDAT7_MASK                     equ 0080h

// Register: NVMDATH
#define NVMDATH NVMDATH
NVMDATH                                  equ 01C8Fh
// bitfield definitions
NVMDATH_NVMDAT_POSN                      equ 0000h
NVMDATH_NVMDAT_POSITION                  equ 0000h
NVMDATH_NVMDAT_SIZE                      equ 0006h
NVMDATH_NVMDAT_LENGTH                    equ 0006h
NVMDATH_NVMDAT_MASK                      equ 003Fh
NVMDATH_NVMDAT8_POSN                     equ 0000h
NVMDATH_NVMDAT8_POSITION                 equ 0000h
NVMDATH_NVMDAT8_SIZE                     equ 0001h
NVMDATH_NVMDAT8_LENGTH                   equ 0001h
NVMDATH_NVMDAT8_MASK                     equ 0001h
NVMDATH_NVMDAT9_POSN                     equ 0001h
NVMDATH_NVMDAT9_POSITION                 equ 0001h
NVMDATH_NVMDAT9_SIZE                     equ 0001h
NVMDATH_NVMDAT9_LENGTH                   equ 0001h
NVMDATH_NVMDAT9_MASK                     equ 0002h
NVMDATH_NVMDAT10_POSN                    equ 0002h
NVMDATH_NVMDAT10_POSITION                equ 0002h
NVMDATH_NVMDAT10_SIZE                    equ 0001h
NVMDATH_NVMDAT10_LENGTH                  equ 0001h
NVMDATH_NVMDAT10_MASK                    equ 0004h
NVMDATH_NVMDAT11_POSN                    equ 0003h
NVMDATH_NVMDAT11_POSITION                equ 0003h
NVMDATH_NVMDAT11_SIZE                    equ 0001h
NVMDATH_NVMDAT11_LENGTH                  equ 0001h
NVMDATH_NVMDAT11_MASK                    equ 0008h
NVMDATH_NVMDAT12_POSN                    equ 0004h
NVMDATH_NVMDAT12_POSITION                equ 0004h
NVMDATH_NVMDAT12_SIZE                    equ 0001h
NVMDATH_NVMDAT12_LENGTH                  equ 0001h
NVMDATH_NVMDAT12_MASK                    equ 0010h
NVMDATH_NVMDAT13_POSN                    equ 0005h
NVMDATH_NVMDAT13_POSITION                equ 0005h
NVMDATH_NVMDAT13_SIZE                    equ 0001h
NVMDATH_NVMDAT13_LENGTH                  equ 0001h
NVMDATH_NVMDAT13_MASK                    equ 0020h

// Register: NVMCON1
#define NVMCON1 NVMCON1
NVMCON1                                  equ 01C90h
// bitfield definitions
NVMCON1_RD_POSN                          equ 0000h
NVMCON1_RD_POSITION                      equ 0000h
NVMCON1_RD_SIZE                          equ 0001h
NVMCON1_RD_LENGTH                        equ 0001h
NVMCON1_RD_MASK                          equ 0001h
NVMCON1_WR_POSN                          equ 0001h
NVMCON1_WR_POSITION                      equ 0001h
NVMCON1_WR_SIZE                          equ 0001h
NVMCON1_WR_LENGTH                        equ 0001h
NVMCON1_WR_MASK                          equ 0002h
NVMCON1_WREN_POSN                        equ 0002h
NVMCON1_WREN_POSITION                    equ 0002h
NVMCON1_WREN_SIZE                        equ 0001h
NVMCON1_WREN_LENGTH                      equ 0001h
NVMCON1_WREN_MASK                        equ 0004h
NVMCON1_WRERR_POSN                       equ 0003h
NVMCON1_WRERR_POSITION                   equ 0003h
NVMCON1_WRERR_SIZE                       equ 0001h
NVMCON1_WRERR_LENGTH                     equ 0001h
NVMCON1_WRERR_MASK                       equ 0008h
NVMCON1_FREE_POSN                        equ 0004h
NVMCON1_FREE_POSITION                    equ 0004h
NVMCON1_FREE_SIZE                        equ 0001h
NVMCON1_FREE_LENGTH                      equ 0001h
NVMCON1_FREE_MASK                        equ 0010h
NVMCON1_LWLO_POSN                        equ 0005h
NVMCON1_LWLO_POSITION                    equ 0005h
NVMCON1_LWLO_SIZE                        equ 0001h
NVMCON1_LWLO_LENGTH                      equ 0001h
NVMCON1_LWLO_MASK                        equ 0020h
NVMCON1_NVMREGS_POSN                     equ 0006h
NVMCON1_NVMREGS_POSITION                 equ 0006h
NVMCON1_NVMREGS_SIZE                     equ 0001h
NVMCON1_NVMREGS_LENGTH                   equ 0001h
NVMCON1_NVMREGS_MASK                     equ 0040h

// Register: NVMCON2
#define NVMCON2 NVMCON2
NVMCON2                                  equ 01C91h
// bitfield definitions
NVMCON2_NVMCON2_POSN                     equ 0000h
NVMCON2_NVMCON2_POSITION                 equ 0000h
NVMCON2_NVMCON2_SIZE                     equ 0008h
NVMCON2_NVMCON2_LENGTH                   equ 0008h
NVMCON2_NVMCON2_MASK                     equ 00FFh

// Register: ADLTHL
#define ADLTHL ADLTHL
ADLTHL                                   equ 01D0Ch
// bitfield definitions
ADLTHL_LTH_POSN                          equ 0000h
ADLTHL_LTH_POSITION                      equ 0000h
ADLTHL_LTH_SIZE                          equ 0008h
ADLTHL_LTH_LENGTH                        equ 0008h
ADLTHL_LTH_MASK                          equ 00FFh
ADLTHL_ADLTH0_POSN                       equ 0000h
ADLTHL_ADLTH0_POSITION                   equ 0000h
ADLTHL_ADLTH0_SIZE                       equ 0001h
ADLTHL_ADLTH0_LENGTH                     equ 0001h
ADLTHL_ADLTH0_MASK                       equ 0001h
ADLTHL_ADLTH1_POSN                       equ 0001h
ADLTHL_ADLTH1_POSITION                   equ 0001h
ADLTHL_ADLTH1_SIZE                       equ 0001h
ADLTHL_ADLTH1_LENGTH                     equ 0001h
ADLTHL_ADLTH1_MASK                       equ 0002h
ADLTHL_ADLTH2_POSN                       equ 0002h
ADLTHL_ADLTH2_POSITION                   equ 0002h
ADLTHL_ADLTH2_SIZE                       equ 0001h
ADLTHL_ADLTH2_LENGTH                     equ 0001h
ADLTHL_ADLTH2_MASK                       equ 0004h
ADLTHL_ADLTH3_POSN                       equ 0003h
ADLTHL_ADLTH3_POSITION                   equ 0003h
ADLTHL_ADLTH3_SIZE                       equ 0001h
ADLTHL_ADLTH3_LENGTH                     equ 0001h
ADLTHL_ADLTH3_MASK                       equ 0008h
ADLTHL_ADLTH4_POSN                       equ 0004h
ADLTHL_ADLTH4_POSITION                   equ 0004h
ADLTHL_ADLTH4_SIZE                       equ 0001h
ADLTHL_ADLTH4_LENGTH                     equ 0001h
ADLTHL_ADLTH4_MASK                       equ 0010h
ADLTHL_ADLTH5_POSN                       equ 0005h
ADLTHL_ADLTH5_POSITION                   equ 0005h
ADLTHL_ADLTH5_SIZE                       equ 0001h
ADLTHL_ADLTH5_LENGTH                     equ 0001h
ADLTHL_ADLTH5_MASK                       equ 0020h
ADLTHL_ADLTH6_POSN                       equ 0006h
ADLTHL_ADLTH6_POSITION                   equ 0006h
ADLTHL_ADLTH6_SIZE                       equ 0001h
ADLTHL_ADLTH6_LENGTH                     equ 0001h
ADLTHL_ADLTH6_MASK                       equ 0040h
ADLTHL_ADLTH7_POSN                       equ 0007h
ADLTHL_ADLTH7_POSITION                   equ 0007h
ADLTHL_ADLTH7_SIZE                       equ 0001h
ADLTHL_ADLTH7_LENGTH                     equ 0001h
ADLTHL_ADLTH7_MASK                       equ 0080h
ADLTHL_ADLTH_POSN                        equ 0000h
ADLTHL_ADLTH_POSITION                    equ 0000h
ADLTHL_ADLTH_SIZE                        equ 0008h
ADLTHL_ADLTH_LENGTH                      equ 0008h
ADLTHL_ADLTH_MASK                        equ 00FFh
ADLTHL_LTH0_POSN                         equ 0000h
ADLTHL_LTH0_POSITION                     equ 0000h
ADLTHL_LTH0_SIZE                         equ 0001h
ADLTHL_LTH0_LENGTH                       equ 0001h
ADLTHL_LTH0_MASK                         equ 0001h
ADLTHL_LTH1_POSN                         equ 0001h
ADLTHL_LTH1_POSITION                     equ 0001h
ADLTHL_LTH1_SIZE                         equ 0001h
ADLTHL_LTH1_LENGTH                       equ 0001h
ADLTHL_LTH1_MASK                         equ 0002h
ADLTHL_LTH2_POSN                         equ 0002h
ADLTHL_LTH2_POSITION                     equ 0002h
ADLTHL_LTH2_SIZE                         equ 0001h
ADLTHL_LTH2_LENGTH                       equ 0001h
ADLTHL_LTH2_MASK                         equ 0004h
ADLTHL_LTH3_POSN                         equ 0003h
ADLTHL_LTH3_POSITION                     equ 0003h
ADLTHL_LTH3_SIZE                         equ 0001h
ADLTHL_LTH3_LENGTH                       equ 0001h
ADLTHL_LTH3_MASK                         equ 0008h
ADLTHL_LTH4_POSN                         equ 0004h
ADLTHL_LTH4_POSITION                     equ 0004h
ADLTHL_LTH4_SIZE                         equ 0001h
ADLTHL_LTH4_LENGTH                       equ 0001h
ADLTHL_LTH4_MASK                         equ 0010h
ADLTHL_LTH5_POSN                         equ 0005h
ADLTHL_LTH5_POSITION                     equ 0005h
ADLTHL_LTH5_SIZE                         equ 0001h
ADLTHL_LTH5_LENGTH                       equ 0001h
ADLTHL_LTH5_MASK                         equ 0020h
ADLTHL_LTH6_POSN                         equ 0006h
ADLTHL_LTH6_POSITION                     equ 0006h
ADLTHL_LTH6_SIZE                         equ 0001h
ADLTHL_LTH6_LENGTH                       equ 0001h
ADLTHL_LTH6_MASK                         equ 0040h
ADLTHL_LTH7_POSN                         equ 0007h
ADLTHL_LTH7_POSITION                     equ 0007h
ADLTHL_LTH7_SIZE                         equ 0001h
ADLTHL_LTH7_LENGTH                       equ 0001h
ADLTHL_LTH7_MASK                         equ 0080h

// Register: ADLTHH
#define ADLTHH ADLTHH
ADLTHH                                   equ 01D0Dh
// bitfield definitions
ADLTHH_LTH_POSN                          equ 0000h
ADLTHH_LTH_POSITION                      equ 0000h
ADLTHH_LTH_SIZE                          equ 0008h
ADLTHH_LTH_LENGTH                        equ 0008h
ADLTHH_LTH_MASK                          equ 00FFh
ADLTHH_ADLTH8_POSN                       equ 0000h
ADLTHH_ADLTH8_POSITION                   equ 0000h
ADLTHH_ADLTH8_SIZE                       equ 0001h
ADLTHH_ADLTH8_LENGTH                     equ 0001h
ADLTHH_ADLTH8_MASK                       equ 0001h
ADLTHH_ADLTH9_POSN                       equ 0001h
ADLTHH_ADLTH9_POSITION                   equ 0001h
ADLTHH_ADLTH9_SIZE                       equ 0001h
ADLTHH_ADLTH9_LENGTH                     equ 0001h
ADLTHH_ADLTH9_MASK                       equ 0002h
ADLTHH_ADLTH10_POSN                      equ 0002h
ADLTHH_ADLTH10_POSITION                  equ 0002h
ADLTHH_ADLTH10_SIZE                      equ 0001h
ADLTHH_ADLTH10_LENGTH                    equ 0001h
ADLTHH_ADLTH10_MASK                      equ 0004h
ADLTHH_ADLTH11_POSN                      equ 0003h
ADLTHH_ADLTH11_POSITION                  equ 0003h
ADLTHH_ADLTH11_SIZE                      equ 0001h
ADLTHH_ADLTH11_LENGTH                    equ 0001h
ADLTHH_ADLTH11_MASK                      equ 0008h
ADLTHH_ADLTH12_POSN                      equ 0004h
ADLTHH_ADLTH12_POSITION                  equ 0004h
ADLTHH_ADLTH12_SIZE                      equ 0001h
ADLTHH_ADLTH12_LENGTH                    equ 0001h
ADLTHH_ADLTH12_MASK                      equ 0010h
ADLTHH_ADLTH13_POSN                      equ 0005h
ADLTHH_ADLTH13_POSITION                  equ 0005h
ADLTHH_ADLTH13_SIZE                      equ 0001h
ADLTHH_ADLTH13_LENGTH                    equ 0001h
ADLTHH_ADLTH13_MASK                      equ 0020h
ADLTHH_ADLTH14_POSN                      equ 0006h
ADLTHH_ADLTH14_POSITION                  equ 0006h
ADLTHH_ADLTH14_SIZE                      equ 0001h
ADLTHH_ADLTH14_LENGTH                    equ 0001h
ADLTHH_ADLTH14_MASK                      equ 0040h
ADLTHH_ADLTH15_POSN                      equ 0007h
ADLTHH_ADLTH15_POSITION                  equ 0007h
ADLTHH_ADLTH15_SIZE                      equ 0001h
ADLTHH_ADLTH15_LENGTH                    equ 0001h
ADLTHH_ADLTH15_MASK                      equ 0080h
ADLTHH_ADLTH_POSN                        equ 0000h
ADLTHH_ADLTH_POSITION                    equ 0000h
ADLTHH_ADLTH_SIZE                        equ 0008h
ADLTHH_ADLTH_LENGTH                      equ 0008h
ADLTHH_ADLTH_MASK                        equ 00FFh
ADLTHH_LTH8_POSN                         equ 0000h
ADLTHH_LTH8_POSITION                     equ 0000h
ADLTHH_LTH8_SIZE                         equ 0001h
ADLTHH_LTH8_LENGTH                       equ 0001h
ADLTHH_LTH8_MASK                         equ 0001h
ADLTHH_LTH9_POSN                         equ 0001h
ADLTHH_LTH9_POSITION                     equ 0001h
ADLTHH_LTH9_SIZE                         equ 0001h
ADLTHH_LTH9_LENGTH                       equ 0001h
ADLTHH_LTH9_MASK                         equ 0002h
ADLTHH_LTH10_POSN                        equ 0002h
ADLTHH_LTH10_POSITION                    equ 0002h
ADLTHH_LTH10_SIZE                        equ 0001h
ADLTHH_LTH10_LENGTH                      equ 0001h
ADLTHH_LTH10_MASK                        equ 0004h
ADLTHH_LTH11_POSN                        equ 0003h
ADLTHH_LTH11_POSITION                    equ 0003h
ADLTHH_LTH11_SIZE                        equ 0001h
ADLTHH_LTH11_LENGTH                      equ 0001h
ADLTHH_LTH11_MASK                        equ 0008h
ADLTHH_LTH12_POSN                        equ 0004h
ADLTHH_LTH12_POSITION                    equ 0004h
ADLTHH_LTH12_SIZE                        equ 0001h
ADLTHH_LTH12_LENGTH                      equ 0001h
ADLTHH_LTH12_MASK                        equ 0010h
ADLTHH_LTH13_POSN                        equ 0005h
ADLTHH_LTH13_POSITION                    equ 0005h
ADLTHH_LTH13_SIZE                        equ 0001h
ADLTHH_LTH13_LENGTH                      equ 0001h
ADLTHH_LTH13_MASK                        equ 0020h
ADLTHH_LTH14_POSN                        equ 0006h
ADLTHH_LTH14_POSITION                    equ 0006h
ADLTHH_LTH14_SIZE                        equ 0001h
ADLTHH_LTH14_LENGTH                      equ 0001h
ADLTHH_LTH14_MASK                        equ 0040h
ADLTHH_LTH15_POSN                        equ 0007h
ADLTHH_LTH15_POSITION                    equ 0007h
ADLTHH_LTH15_SIZE                        equ 0001h
ADLTHH_LTH15_LENGTH                      equ 0001h
ADLTHH_LTH15_MASK                        equ 0080h

