GopalSaraf/Practicals/PSDL/include/proc/pic16f18075.inc
#define ANSD6                            BANKMASK(ANSELD), 6
#define ANSD7                            BANKMASK(ANSELD), 7
#define ANSE0                            BANKMASK(ANSELE), 0
#define ANSE1                            BANKMASK(ANSELE), 1
#define ANSE2                            BANKMASK(ANSELE), 2
#define ANSELA0                          BANKMASK(ANSELA), 0
#define ANSELA1                          BANKMASK(ANSELA), 1
#define ANSELA2                          BANKMASK(ANSELA), 2
#define ANSELA3                          BANKMASK(ANSELA), 3
#define ANSELA4                          BANKMASK(ANSELA), 4
#define ANSELA5                          BANKMASK(ANSELA), 5
#define ANSELA6                          BANKMASK(ANSELA), 6
#define ANSELA7                          BANKMASK(ANSELA), 7
#define ANSELB0                          BANKMASK(ANSELB), 0
#define ANSELB1                          BANKMASK(ANSELB), 1
#define ANSELB2                          BANKMASK(ANSELB), 2
#define ANSELB3                          BANKMASK(ANSELB), 3
#define ANSELB4                          BANKMASK(ANSELB), 4
#define ANSELB5                          BANKMASK(ANSELB), 5
#define ANSELB6                          BANKMASK(ANSELB), 6
#define ANSELB7                          BANKMASK(ANSELB), 7
#define ANSELC0                          BANKMASK(ANSELC), 0
#define ANSELC1                          BANKMASK(ANSELC), 1
#define ANSELC2                          BANKMASK(ANSELC), 2
#define ANSELC3                          BANKMASK(ANSELC), 3
#define ANSELC4                          BANKMASK(ANSELC), 4
#define ANSELC5                          BANKMASK(ANSELC), 5
#define ANSELC6                          BANKMASK(ANSELC), 6
#define ANSELC7                          BANKMASK(ANSELC), 7
#define ANSELD0                          BANKMASK(ANSELD), 0
#define ANSELD1                          BANKMASK(ANSELD), 1
#define ANSELD2                          BANKMASK(ANSELD), 2
#define ANSELD3                          BANKMASK(ANSELD), 3
#define ANSELD4                          BANKMASK(ANSELD), 4
#define ANSELD5                          BANKMASK(ANSELD), 5
#define ANSELD6                          BANKMASK(ANSELD), 6
#define ANSELD7                          BANKMASK(ANSELD), 7
#define ANSELE0                          BANKMASK(ANSELE), 0
#define ANSELE1                          BANKMASK(ANSELE), 1
#define ANSELE2                          BANKMASK(ANSELE), 2
#define AOV                              BANKMASK(ADSTAT), 7
#define AS0E                             BANKMASK(CWG1AS1), 0
#define AS1E                             BANKMASK(CWG1AS1), 1
#define AS2E                             BANKMASK(CWG1AS1), 2
#define AS3E                             BANKMASK(CWG1AS1), 3
#define AS4E                             BANKMASK(CWG1AS1), 4
#define AS5E                             BANKMASK(CWG1AS1), 5
#define AS6E                             BANKMASK(CWG1AS1), 6
#define AS7E                             BANKMASK(CWG1AS1), 7
#define ASYNC                            BANKMASK(T0CON1), 4
#define BCL1IE                           BANKMASK(PIE3), 7
#define BCL1IF                           BANKMASK(PIR3), 7
#define BCL2IE                           BANKMASK(PIE4), 1
#define BCL2IF                           BANKMASK(PIR4), 1
#define BF1                              BANKMASK(SSP1STAT), 0
#define BF2                              BANKMASK(SSP2STAT), 0
#define BORRDY                           BANKMASK(BORCON), 0
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define BSR5                             BANKMASK(BSR), 5
#define C1EN                             BANKMASK(CM1CON0), 7
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1INTN                           BANKMASK(CM1CON1), 0
#define C1INTP                           BANKMASK(CM1CON1), 1
#define C1NCH0                           BANKMASK(CM1NCH), 0
#define C1NCH1                           BANKMASK(CM1NCH), 1
#define C1NCH2                           BANKMASK(CM1NCH), 2
#define C1PCH0                           BANKMASK(CM1PCH), 0
#define C1PCH1                           BANKMASK(CM1PCH), 1
#define C1PCH2                           BANKMASK(CM1PCH), 2
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define CAL01                            BANKMASK(TMR1L), 0
#define CAL03                            BANKMASK(TMR3L), 0
#define CAL11                            BANKMASK(TMR1L), 1
#define CAL13                            BANKMASK(TMR3L), 1
#define CAL21                            BANKMASK(TMR1L), 2
#define CAL23                            BANKMASK(TMR3L), 2
#define CAL31                            BANKMASK(TMR1L), 3
#define CAL33                            BANKMASK(TMR3L), 3
#define CAL41                            BANKMASK(TMR1L), 4
#define CAL43                            BANKMASK(TMR3L), 4
#define CAL51                            BANKMASK(TMR1L), 5
#define CAL53                            BANKMASK(TMR3L), 5
#define CAL61                            BANKMASK(TMR1L), 6
#define CAL63                            BANKMASK(TMR3L), 6
#define CAL71                            BANKMASK(TMR1L), 7
#define CAL73                            BANKMASK(TMR3L), 7
#define CALC0                            BANKMASK(ADCON3), 4
#define CALC1                            BANKMASK(ADCON3), 5
#define CALC2                            BANKMASK(ADCON3), 6
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2
#define CCP1CTS3                         BANKMASK(CCP1CAP), 3
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE2), 2
#define CCP1IF                           BANKMASK(PIR2), 2
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4
#define CCP1PPS5                         BANKMASK(CCP1PPS), 5
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2
#define CCP2CTS3                         BANKMASK(CCP2CAP), 3
#define CCP2EN                           BANKMASK(CCP2CON), 7
#define CCP2FMT                          BANKMASK(CCP2CON), 4
#define CCP2IE                           BANKMASK(PIE2), 3
#define CCP2IF                           BANKMASK(PIR2), 3
#define CCP2MODE0                        BANKMASK(CCP2CON), 0
#define CCP2MODE1                        BANKMASK(CCP2CON), 1
#define CCP2MODE2                        BANKMASK(CCP2CON), 2
#define CCP2MODE3                        BANKMASK(CCP2CON), 3
#define CCP2OUT                          BANKMASK(CCP2CON), 5
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4
#define CCP2PPS5                         BANKMASK(CCP2PPS), 5
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CGA0                             BANKMASK(ADCG1A), 0
#define CGA1                             BANKMASK(ADCG1A), 1
#define CGA2                             BANKMASK(ADCG1A), 2
#define CGA3                             BANKMASK(ADCG1A), 3
#define CGA4                             BANKMASK(ADCG1A), 4
#define CGA5                             BANKMASK(ADCG1A), 5
#define CGA6                             BANKMASK(ADCG1A), 6
#define CGA7                             BANKMASK(ADCG1A), 7
#define CGB0                             BANKMASK(ADCG1B), 0
#define CGB1                             BANKMASK(ADCG1B), 1
#define CGB2                             BANKMASK(ADCG1B), 2
#define CGB3                             BANKMASK(ADCG1B), 3
#define CGB4                             BANKMASK(ADCG1B), 4
#define CGB5                             BANKMASK(ADCG1B), 5
#define CGB6                             BANKMASK(ADCG1B), 6
#define CGB7                             BANKMASK(ADCG1B), 7
#define CGC0                             BANKMASK(ADCG1C), 0
#define CGC1                             BANKMASK(ADCG1C), 1
#define CGC2                             BANKMASK(ADCG1C), 2
#define CGC3                             BANKMASK(ADCG1C), 3
#define CGC4                             BANKMASK(ADCG1C), 4
#define CGC5                             BANKMASK(ADCG1C), 5
#define CGC6                             BANKMASK(ADCG1C), 6
#define CGC7                             BANKMASK(ADCG1C), 7
#define CGD0                             BANKMASK(ADCG1D), 0
#define CGD1                             BANKMASK(ADCG1D), 1
#define CGD2                             BANKMASK(ADCG1D), 2
#define CGD3                             BANKMASK(ADCG1D), 3
#define CGD4                             BANKMASK(ADCG1D), 4
#define CGD5                             BANKMASK(ADCG1D), 5
#define CGD6                             BANKMASK(ADCG1D), 6
#define CGD7                             BANKMASK(ADCG1D), 7
#define CGE0                             BANKMASK(ADCG1E), 0
#define CGE1                             BANKMASK(ADCG1E), 1
#define CGE2                             BANKMASK(ADCG1E), 2
#define CKE1                             BANKMASK(SSP1STAT), 6
#define CKE2                             BANKMASK(SSP2STAT), 6
#define CKP1                             BANKMASK(SSP1CON1), 4
#define CKP2                             BANKMASK(SSP2CON1), 4
#define CKPS3                            BANKMASK(T0CON1), 3
#define CKS0                             BANKMASK(NCO1CLK), 0
#define CKS1                             BANKMASK(NCO1CLK), 1
#define CKS2                             BANKMASK(NCO1CLK), 2
#define CKS3                             BANKMASK(NCO1CLK), 3
#define CLC1IE                           BANKMASK(PIE2), 6
#define CLC1IF                           BANKMASK(PIR2), 6
#define CLC1OUT                          BANKMASK(CLCDATA), 0
#define CLC2IE                           BANKMASK(PIE2), 7
#define CLC2IF                           BANKMASK(PIR2), 7
#define CLC2OUT                          BANKMASK(CLCDATA), 1
#define CLC3IE                           BANKMASK(PIE3), 0
#define CLC3IF                           BANKMASK(PIR3), 0
#define CLC3OUT                          BANKMASK(CLCDATA), 2
#define CLC4IE                           BANKMASK(PIE3), 1
#define CLC4IF                           BANKMASK(PIR3), 1
#define CLC4OUT                          BANKMASK(CLCDATA), 3
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4
#define CLCIN0PPS5                       BANKMASK(CLCIN0PPS), 5
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4
#define CLCIN1PPS5                       BANKMASK(CLCIN1PPS), 5
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4
#define CLCIN2PPS5                       BANKMASK(CLCIN2PPS), 5
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4
#define CLCIN3PPS5                       BANKMASK(CLCIN3PPS), 5
#define CM1IE                            BANKMASK(PIE4), 2
#define CM1IF                            BANKMASK(PIR4), 2
#define CNT0                             BANKMASK(ADCNT), 0
#define CNT1                             BANKMASK(ADCNT), 1
#define CNT2                             BANKMASK(ADCNT), 2
#define CNT3                             BANKMASK(ADCNT), 3
#define CNT4                             BANKMASK(ADCNT), 4
#define CNT5                             BANKMASK(ADCNT), 5
#define CNT6                             BANKMASK(ADCNT), 6
#define CNT7                             BANKMASK(ADCNT), 7
#define CONT                             BANKMASK(ADCON0), 6
#define COSC0                            BANKMASK(OSCCON2), 4
#define COSC1                            BANKMASK(OSCCON2), 5
#define COSC2                            BANKMASK(OSCCON2), 6
#define CPOS                             BANKMASK(CPCON), 5
#define CPRDY                            BANKMASK(CPCON), 0
#define CPREQ                            BANKMASK(CPCON), 2
#define CPT                              BANKMASK(CPCON), 1
#define CRS0                             BANKMASK(ADCON2), 4
#define CRS1                             BANKMASK(ADCON2), 5
#define CRS2                             BANKMASK(ADCON2), 6
#define CS5                              BANKMASK(ADCLK), 5
#define CWG1CS                           BANKMASK(CWG1CLK), 0
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5
#define CWG1EN                           BANKMASK(CWG1CON0), 7
#define CWG1IE                           BANKMASK(PIE2), 5
#define CWG1IF                           BANKMASK(PIR2), 5
#define CWG1IN                           BANKMASK(CWG1CON1), 5
#define CWG1LD                           BANKMASK(CWG1CON0), 6
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2
#define CWG1OVRA                         BANKMASK(CWG1STR), 4
#define CWG1OVRB                         BANKMASK(CWG1STR), 5
#define CWG1OVRC                         BANKMASK(CWG1STR), 6
#define CWG1OVRD                         BANKMASK(CWG1STR), 7
#define CWG1POLA                         BANKMASK(CWG1CON1), 0
#define CWG1POLB                         BANKMASK(CWG1CON1), 1
#define CWG1POLC                         BANKMASK(CWG1CON1), 2
#define CWG1POLD                         BANKMASK(CWG1CON1), 3
#define CWG1PPS0                         BANKMASK(CWG1PPS), 0
#define CWG1PPS1                         BANKMASK(CWG1PPS), 1
#define CWG1PPS2                         BANKMASK(CWG1PPS), 2
#define CWG1PPS3                         BANKMASK(CWG1PPS), 3
#define CWG1PPS4                         BANKMASK(CWG1PPS), 4
#define CWG1PPS5                         BANKMASK(CWG1PPS), 5
#define CWG1STRA                         BANKMASK(CWG1STR), 0
#define CWG1STRB                         BANKMASK(CWG1STR), 1
#define CWG1STRC                         BANKMASK(CWG1STR), 2
#define CWG1STRD                         BANKMASK(CWG1STR), 3
#define D1S0                             BANKMASK(CLCnSEL0), 0
#define D1S1                             BANKMASK(CLCnSEL0), 1
#define D1S2                             BANKMASK(CLCnSEL0), 2
#define D1S3                             BANKMASK(CLCnSEL0), 3
#define D1S4                             BANKMASK(CLCnSEL0), 4
#define D1S5                             BANKMASK(CLCnSEL0), 5
#define D2S0                             BANKMASK(CLCnSEL1), 0
#define D2S1                             BANKMASK(CLCnSEL1), 1
#define D2S2                             BANKMASK(CLCnSEL1), 2
#define D2S3                             BANKMASK(CLCnSEL1), 3
#define D2S4                             BANKMASK(CLCnSEL1), 4
#define D2S5                             BANKMASK(CLCnSEL1), 5
#define D3S0                             BANKMASK(CLCnSEL2), 0
#define D3S1                             BANKMASK(CLCnSEL2), 1
#define D3S2                             BANKMASK(CLCnSEL2), 2
#define D3S3                             BANKMASK(CLCnSEL2), 3
#define D3S4                             BANKMASK(CLCnSEL2), 4
#define D3S5                             BANKMASK(CLCnSEL2), 5
#define D4S0                             BANKMASK(CLCnSEL3), 0
#define D4S1                             BANKMASK(CLCnSEL3), 1
#define D4S2                             BANKMASK(CLCnSEL3), 2
#define D4S3                             BANKMASK(CLCnSEL3), 3
#define D4S4                             BANKMASK(CLCnSEL3), 4
#define D4S5                             BANKMASK(CLCnSEL3), 5
#define DA1                              BANKMASK(SSP1STAT), 5
#define DA2                              BANKMASK(SSP2STAT), 5
#define DAT0                             BANKMASK(CWG1ISM), 0
#define DAT1                             BANKMASK(CWG1ISM), 1
#define DAT2                             BANKMASK(CWG1ISM), 2
#define DAT3                             BANKMASK(CWG1ISM), 3
#define DATA_ADDRESS1                    BANKMASK(SSP1STAT), 5
#define DATA_ADDRESS2                    BANKMASK(SSP2STAT), 5
#define DBF0                             BANKMASK(CWG1DBF), 0
#define DBF1                             BANKMASK(CWG1DBF), 1
#define DBF2                             BANKMASK(CWG1DBF), 2
#define DBF3                             BANKMASK(CWG1DBF), 3
#define DBF4                             BANKMASK(CWG1DBF), 4
#define DBF5                             BANKMASK(CWG1DBF), 5
#define DBR0                             BANKMASK(CWG1DBR), 0
#define DBR1                             BANKMASK(CWG1DBR), 1
#define DBR2                             BANKMASK(CWG1DBR), 2
#define DBR3                             BANKMASK(CWG1DBR), 3
#define DBR4                             BANKMASK(CWG1DBR), 4
#define DBR5                             BANKMASK(CWG1DBR), 5
#define DC                               BANKMASK(STATUS), 1
#define DONE                             BANKMASK(ADCON0), 0
#define DSEN                             BANKMASK(ADCON1), 0
#define D_A1                             BANKMASK(SSP1STAT), 5
#define D_A2                             BANKMASK(SSP2STAT), 5
#define D_nA1                            BANKMASK(SSP1STAT), 5
#define D_nA2                            BANKMASK(SSP2STAT), 5
#define ERR0                             BANKMASK(ADERRL), 0
#define ERR1                             BANKMASK(ADERRL), 1
#define ERR10                            BANKMASK(ADERRH), 2
#define ERR11                            BANKMASK(ADERRH), 3
#define ERR12                            BANKMASK(ADERRH), 4
#define ERR13                            BANKMASK(ADERRH), 5
#define ERR14                            BANKMASK(ADERRH), 6
#define ERR15                            BANKMASK(ADERRH), 7
#define ERR2                             BANKMASK(ADERRL), 2
#define ERR3                             BANKMASK(ADERRL), 3
#define ERR4                             BANKMASK(ADERRL), 4
#define ERR5                             BANKMASK(ADERRL), 5
#define ERR6                             BANKMASK(ADERRL), 6
#define ERR7                             BANKMASK(ADERRL), 7
#define ERR8                             BANKMASK(ADERRH), 0
#define ERR9                             BANKMASK(ADERRH), 1
#define FLTR0                            BANKMASK(ADFLTRL), 0
#define FLTR1                            BANKMASK(ADFLTRL), 1
#define FLTR10                           BANKMASK(ADFLTRH), 2
#define FLTR11                           BANKMASK(ADFLTRH), 3
#define FLTR12                           BANKMASK(ADFLTRH), 4
#define FLTR13                           BANKMASK(ADFLTRH), 5
#define FLTR14                           BANKMASK(ADFLTRH), 6
#define FLTR15                           BANKMASK(ADFLTRH), 7
#define FLTR2                            BANKMASK(ADFLTRL), 2
#define FLTR3                            BANKMASK(ADFLTRL), 3
#define FLTR4                            BANKMASK(ADFLTRL), 4
#define FLTR5                            BANKMASK(ADFLTRL), 5
#define FLTR6                            BANKMASK(ADFLTRL), 6
#define FLTR7                            BANKMASK(ADFLTRL), 7
#define FLTR8                            BANKMASK(ADFLTRH), 0
#define FLTR9                            BANKMASK(ADFLTRH), 1
#define FM0                              BANKMASK(ADCON0), 2
#define FREE                             BANKMASK(NVMCON1), 4
#define FRQ0                             BANKMASK(OSCFRQ), 0
#define FRQ1                             BANKMASK(OSCFRQ), 1
#define FRQ2                             BANKMASK(OSCFRQ), 2
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define G1D1N                            BANKMASK(CLCnGLS0), 0
#define G1D1T                            BANKMASK(CLCnGLS0), 1
#define G1D2N                            BANKMASK(CLCnGLS0), 2
#define G1D2T                            BANKMASK(CLCnGLS0), 3
#define G1D3N                            BANKMASK(CLCnGLS0), 4
#define G1D3T                            BANKMASK(CLCnGLS0), 5
#define G1D4N                            BANKMASK(CLCnGLS0), 6
#define G1D4T                            BANKMASK(CLCnGLS0), 7
#define G1EN                             BANKMASK(CWG1CON0), 7
#define G1POL                            BANKMASK(CLCnPOL), 0
#define G2D1N                            BANKMASK(CLCnGLS1), 0
#define G2D1T                            BANKMASK(CLCnGLS1), 1
#define G2D2N                            BANKMASK(CLCnGLS1), 2
#define G2D2T                            BANKMASK(CLCnGLS1), 3
#define G2D3N                            BANKMASK(CLCnGLS1), 4
#define G2D3T                            BANKMASK(CLCnGLS1), 5
#define G2D4N                            BANKMASK(CLCnGLS1), 6
#define G2D4T                            BANKMASK(CLCnGLS1), 7
#define G2POL                            BANKMASK(CLCnPOL), 1
